{
  "backend/main.mo": "Empty Motoko actor definition with no logic implemented.",
  "feature_evidence.json": "Feature evidence report mapping Rose Day features to related source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for key frontend files in the Rose Day experience.",
  "frontend/index.css": "Tailwind base layer defining OKLCH theme variables, dark mode variants, and global background/foreground styles.",
  "frontend/index.html": "HTML entry point loading the React application via main.tsx into the root div.",
  "frontend/src/App.tsx": "Minimal root component that renders the RoseDayExperience.",
  "frontend/src/components/layout/SiteFrame.tsx": "Provides the global layout with background image, gradient overlay, header, and footer wrapping all scenes.",
  "frontend/src/features/roseDay/RoseDayExperience.tsx": "State machine driving landing, prompt, building, and finale phases with rose-count logic and 3D scene rendering.",
  "frontend/src/features/roseDay/scenes/BuildOverlay.tsx": "Bottom overlay UI showing bouquet progress, rose count, and an Add Rose button during the building phase.",
  "frontend/src/features/roseDay/scenes/FinalePanel.tsx": "Centered finale card displaying the completed bouquet message, rose total, and restart option.",
  "frontend/src/features/roseDay/scenes/LandingPanel.tsx": "Intro card with Rose Day greeting, brief narrative, and a start button.",
  "frontend/src/features/roseDay/scenes/PromptPanel.tsx": "Narrative transition card explaining the upcoming bouquet-building interaction and prompting continuation.",
  "frontend/src/features/roseDay/three/bouquetLayout.ts": "Generates positions, rotations, and scale for roses in a spiral layered bouquet layout using constants.",
  "frontend/src/features/roseDay/three/BouquetScene.tsx": "React Three Fiber scene with camera, controls, lights, vase model, and animated roses positioned via bouquet layout.",
  "frontend/src/features/roseDay/three/constants.ts": "Holds bouquet and animation constants like vase radius, layer spacing, tilt, and spawn offsets.",
  "frontend/src/features/roseDay/three/Rose.tsx": "Animated 3D rose component using react-three-fiber with entrance and floating effects plus detailed petal, stem, and leaf geometry.",
  "frontend/src/features/roseDay/three/Vase.tsx": "Defines a simple 3D vase composed of cylinder-based meshes with materials for body, rim, and base.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state, identity management, and an authentication context using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are used.",
  "frontend/src/index.css": "Base Tailwind styles and custom Rose Day themed color variables plus typography and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClient, and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors from CSS variables, animations, and plugins like typography and container queries.",
  "project_state.json": "Defines the project’s state, required images, and a list of implemented features for an interactive Rose Day website with a 3D bouquet-building flow. Includes metadata, existing features, and begins listing new feature requests."
}